#include <iostream> 
#include <cstring> 

int main()
{
    std::cout << "ਉਸ ਵਿਅਕਤੀ ਦਾ ਨਾਂ ਲਿੱਖੋ, ਜਿਸ ਨੂੰ ਤੁਸੀ ਚਿੱਠੀ ਪਾਉਣਾ ਚਾਹੁੰਦੇ ਹੋ: ";
    // first_name ਦਾ ਮਤਲਬ ਕਿਸੀ ਵਿਅਕਤੀ ਦਾ ਪਹਿਲਾ ਨਾਂ ਹੈ। ਜਿਵੇਂ ਕਿ ਭਗਤ ਸਿੰਘ ਦਾ 
    // ਦਾ ਪਹਿਲਾ ਨਾਮ ਭਗਤ ਹੈ ਅਤੇ ਆਖਰੀ (ਜਾਂ ਵਿਚਲਾ) ਨਾਂ ਸਿੰਘ। 
    std::string first_name; 
    std::cin >> first_name; 
    std::cout << "ਪਿਆਰੇ  " << first_name << ",\n"; 
    std::cout << "\tਤੇਰੇ ਕੀ ਹਾਲ-ਚਾਲ ਹਨ? ਮੈਂ ਠੀਕ ਹਾਂ ਅਤੇ ਤੈਨੂੰ ਅਕਸਰ ਯਾਦ ਕਰਦਾ ਹਾਂ। "
              << "ਇਸ ਗਲ ਦੀ ਉਮੀਦ ਕਰਦਾ ਹਾਂ ਕਿ ਇਹ ਚਿੱਠੀ ਤੇਰੇ ਤਕ ਜ਼ਰੂਰ ਪਹੁੰਚੇਗੀ।\n";
    std::cout << "\tਕੀ ਤੈਨੂੰ ਯਾਦ ਹੈ ਕਿ ਜਦੋਂ ਅਸੀ ਕਾਲਜ ਵਿਚ ਪੜ੍ਹਦੇ ਸੀ, ਤਾਂ ਸਾਡੇ ਨਾਲ "
              << "ਇੱਕ ਹੋਰ ਮੁੰਡਾ ਵੀ ਪੜ੍ਹਦਾ ਹੁੰਦਾ ਸੀ। ਉਹ ਬਥੇਰੀਆਂ ਕਿਤਾਬਾਂ ਪੜ੍ਹਿਆ ਕਰਦਾ "
              << "ਸੀ ਅਤੇ ਪਟਿਆਲੇ ਦੇ ਕਿਸੇ ਨੇੜਲੇ ਪਿੰਡ ਤੋਂ ਸਪਲੈਨਡਰ 'ਤੇ ਆਉਂਦਾ ਸੀ। "
              << "ਕੀ ਤੈਨੂੰ ਉਸਦਾ ਨਾਂ ਯਾਦ ਹੈ? ਜੇ ਹਾਂ, ਤਾਂ ਫਿਰ ਲਿੱਖ ਦੇ: ";
    // ਉਸ ਦੋਸਤ ਦਾ ਨਾਮ friend_name ਵੇਰੀਏਬਲ ਵਿਚ ਸਟੋਰ ਹੋਵੇਗਾ। 
    std::string friend_name; 
    std::cin >> friend_name; 
    std::cout << "ਸਹੀ! ਲੇਕਿਨ ਕੀ ਤੂੰ " << friend_name << " ਨੂੰ ਅੱਜਕਲ੍ਹ ਵੇਖਿਆ ਹੈ?\n"; 
    std::cout << "ਇਸ ਤੋਂ ਇੱਕ ਹੋਰ ਗਲ ਯਾਦ ਆਈ ਕਿ ਆਪਣੀ ਕਲਾਸ ਵਿਚ ਇੱਕ ਹੋਰ "
              << friend_name << " ਨਾਂ ਦਾ ਸਟੂਡੈਂਟ ਸੀ। ਕੀ ਉਹ ਮੁੰਡਾ ਸੀ ਜਾਂ ਕੁੜੀ? ਜੇ ਉਹ "
              << "ਮੁੰਡਾ ਸੀ ਤਾਂ m ਲਿੱਖ ਅਤੇ ਜੇ ਉਹ ਕੁੜੀ ਸੀ ਤਾਂ f ਲਿੱਖ: "; 
     // friend_sex friend_name ਦੇ ਹਮਨਾਮ ਦੀ ਲਿੰਗ ਬਾਰੇ ਜਾਣਕਾਰੀ ਸਟੋਰ ਕਰਦਾ ਹੈ। 
     char friend_sex = 0; 
     std::cin >> friend_sex; 
     if (friend_sex == 'm') {
        std::cout << "ਜੇ ਤੈਨੂੰ " << friend_name << " ਦਿੱਖੇ, ਤਾਂ ਉਸ ਨੂੰ ਕਹੀ ਕਿ "
                  << "ਮੈਨੂੰ ਕਾਲ ਜ਼ਰੂਰ ਕਰੇਗਾ।\n";
        }
        
     if (friend_sex = 'n') {
        std::cout << "ਜੇ ਤੈਨੂੰ " << friend_name << " ਦਿੱਖੇ, ਤਾਂ ਉਸ ਨੂੰ ਕਹੀ ਕਿ "
                  << "ਮੈਨੂੰ ਕਾਲ ਜ਼ਰੂਰ ਕਰੇਗੀ।\n";
        }
        
    std::cout << "ਇਸ ਤੋਂ ਇੱਕ ਹੋਰ ਗਲ ਯਾਦ ਆਈ। ਮੈਂ ਸੁਣਿਆ ਕਿ ਤੇਰਾ ਜਨਮਦਿਨ ਹੁਣੇ-"
              << "ਹੁਣੇ ਨਿਕਲਿਆ ਹੈ। ਫਿਰ ਕਿਨ੍ਹੇ ਸਾਲਾਂ ਦਾ ਹੋ ਗਿਆ?" ; 
              
    // age ਵੇਰੀਏਬਲ ਉਮਰ ਸਟੋਰ ਕਰਦਾ ਹੈ। 
    int age = 0; 
    std::cin >> age; 
    if ((age < 0) || (age > 110)) {
        std::cout << "ਮਜ਼ਾਕ ਨਾ ਕਰ!\n"; // ਇੱਥੇ ਬਯਾਰਨ ਸਤੋਰਸਟ੍ਰੂਪ error ਫੰਕਸ਼ਨ ਕਾਲ ਕਰਨ ਨੂੰ ਕਹਿੰਦਾ ਹੈ, ਨਾ ਕਿ std:cout ਯੂਜ਼ ਕਰਨ ਨੂੰ। 
        }
     
    if (age < 12) {
        std::cout << "ਤਾਂ ਅਗਲੇ ਵਰ੍ਹੇ ਤੁਸੀ " << age + 1 << " ਸਾਲਾਂ ਦੇ ਹੋ ਜਾਵੋਗੇ।\n"; 
        }
        
    if (age == 17) {
        std::cout << "ਵਧਾਈਆਂ ਹੋਣ! ਤਾਂ ਅਗਲੇ ਸਾਲ ਕਿਸ ਨੂੰ ਵੋਟ ਪਾਉਣੀ ਹੈ - ਅਕਾਲੀ, ਕਾਂਗਰਸ ਜਾਂ ਆਪ?\n"; 
        }
        
    if (age > 70) {
        std::cout << "ਤਾਂ ਫਿਰ ਰਿਟਾਏਰਮੈਂਟ ਦੇ ਮਜ਼ੇ ਲਿਤੇ ਜਾ ਰਹੇ ਨੇ।\n";
        }
        
    std::cout << "ਤੁਹਾਡਾ ਦੋਸਤ\n"
              << "ਚੇਤਨ\n"; 
        
     
    return 0;
}
